STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257dxx_ca35.h
/*********  Bit definition for ETH_TX_OCTET_COUNT_GOOD_BAD register  **********/
#define ETH_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_Pos                         (0U)
#define ETH_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_Msk                         (0xFFFFFFFFUL << ETH_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_Pos)                 /*!< 0xFFFFFFFF */
#define ETH_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB                             ETH_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_Msk                                  /*!< Tx Octet Count Good Bad */

/*********  Bit definition for ETH_TX_PACKET_COUNT_GOOD_BAD register  *********/
#define ETH_TX_PACKET_COUNT_GOOD_BAD_TXPKTGB_Pos                        (0U)
#define ETH_TX_PACKET_COUNT_GOOD_BAD_TXPKTGB_Msk                        (0xFFFFFFFFUL << ETH_TX_PACKET_COUNT_GOOD_BAD_TXPKTGB_Pos)                /*!< 0xFFFFFFFF */
#define ETH_TX_PACKET_COUNT_GOOD_BAD_TXPKTGB                            ETH_TX_PACKET_COUNT_GOOD_BAD_TXPKTGB_Msk                                 /*!< Tx Packet Count Good Bad */

/********  Bit definition for ETH_TX_BROADCAST_PACKETS_GOOD register  *********/
#define ETH_TX_BROADCAST_PACKETS_GOOD_TXBCASTG_Pos                      (0U)
#define ETH_TX_BROADCAST_PACKETS_GOOD_TXBCASTG_Msk                      (0xFFFFFFFFUL << ETH_TX_BROADCAST_PACKETS_GOOD_TXBCASTG_Pos)              /*!< 0xFFFFFFFF */
#define ETH_TX_BROADCAST_PACKETS_GOOD_TXBCASTG                          ETH_TX_BROADCAST_PACKETS_GOOD_TXBCASTG_Msk                               /*!< Tx Broadcast Packets Good */

/********  Bit definition for ETH_TX_MULTICAST_PACKETS_GOOD register  *********/
#define ETH_TX_MULTICAST_PACKETS_GOOD_TXMCASTG_Pos                      (0U)
#define ETH_TX_MULTICAST_PACKETS_GOOD_TXMCASTG_Msk                      (0xFFFFFFFFUL << ETH_TX_MULTICAST_PACKETS_GOOD_TXMCASTG_Pos)              /*!< 0xFFFFFFFF */
#define ETH_TX_MULTICAST_PACKETS_GOOD_TXMCASTG                          ETH_TX_MULTICAST_PACKETS_GOOD_TXMCASTG_Msk                               /*!< Tx multicast Packets Good */

/*******  Bit definition for ETH_TX_64OCTETS_PACKETS_GOOD_BAD register  *******/
#define ETH_TX_64OCTETS_PACKETS_GOOD_BAD_TX64OCTGB_Pos                  (0U)
#define ETH_TX_64OCTETS_PACKETS_GOOD_BAD_TX64OCTGB_Msk                  (0xFFFFFFFFUL << ETH_TX_64OCTETS_PACKETS_GOOD_BAD_TX64OCTGB_Pos)          /*!< 0xFFFFFFFF */
#define ETH_TX_64OCTETS_PACKETS_GOOD_BAD_TX64OCTGB                      ETH_TX_64OCTETS_PACKETS_GOOD_BAD_TX64OCTGB_Msk                           /*!< Tx 64 octets Packets Good Bad */

/****  Bit definition for ETH_TX_64TO127OCTETS_PACKETS_GOOD_BAD register  *****/
#define ETH_TX_64TO127OCTETS_PACKETS_GOOD_BAD_TX65_127OCTGB_Pos         (0U)
#define ETH_TX_64TO127OCTETS_PACKETS_GOOD_BAD_TX65_127OCTGB_Msk         (0xFFFFFFFFUL << ETH_TX_64TO127OCTETS_PACKETS_GOOD_BAD_TX65_127OCTGB_Pos) /*!< 0xFFFFFFFF */
#define ETH_TX_64TO127OCTETS_PACKETS_GOOD_BAD_TX65_127OCTGB             ETH_TX_64TO127OCTETS_PACKETS_GOOD_BAD_TX65_127OCTGB_Msk                  /*!< Tx 65 to 127 octets Packets Good Bad */

/****  Bit definition for ETH_TX_128TO255OCTETS_PACKETS_GOOD_BAD register  ****/
#define ETH_TX_128TO255OCTETS_PACKETS_GOOD_BAD_TX128_255OCTGB_Pos       (0U)
#define ETH_TX_128TO255OCTETS_PACKETS_GOOD_BAD_TX128_255OCTGB_Msk       (0xFFFFFFFFUL << ETH_TX_128TO255OCTETS_PACKETS_GOOD_BAD_TX128_255OCTGB_Pos) /*!< 0xFFFFFFFF */
#define ETH_TX_128TO255OCTETS_PACKETS_GOOD_BAD_TX128_255OCTGB           ETH_TX_128TO255OCTETS_PACKETS_GOOD_BAD_TX128_255OCTGB_Msk                /*!< Tx 128 to 255 octets Packets Good Bad */

/****  Bit definition for ETH_TX_256TO511OCTETS_PACKETS_GOOD_BAD register  ****/
#define ETH_TX_256TO511OCTETS_PACKETS_GOOD_BAD_TX256_511OCTGB_Pos       (0U)
#define ETH_TX_256TO511OCTETS_PACKETS_GOOD_BAD_TX256_511OCTGB_Msk       (0xFFFFFFFFUL << ETH_TX_256TO511OCTETS_PACKETS_GOOD_BAD_TX256_511OCTGB_Pos) /*!< 0xFFFFFFFF */
#define ETH_TX_256TO511OCTETS_PACKETS_GOOD_BAD_TX256_511OCTGB           ETH_TX_256TO511OCTETS_PACKETS_GOOD_BAD_TX256_511OCTGB_Msk                /*!< Tx 256 to 511 octets Packets Good Bad */

/***  Bit definition for ETH_TX_512TO1023OCTETS_PACKETS_GOOD_BAD register  ****/
#define ETH_TX_512TO1023OCTETS_PACKETS_GOOD_BAD_TX512_1023OCTGB_Pos     (0U)
#define ETH_TX_512TO1023OCTETS_PACKETS_GOOD_BAD_TX512_1023OCTGB_Msk     (0xFFFFFFFFUL << ETH_TX_512TO1023OCTETS_PACKETS_GOOD_BAD_TX512_1023OCTGB_Pos)   /*!< 0xFFFFFFFF */
#define ETH_TX_512TO1023OCTETS_PACKETS_GOOD_BAD_TX512_1023OCTGB         ETH_TX_512TO1023OCTETS_PACKETS_GOOD_BAD_TX512_1023OCTGB_Msk              /*!< Tx 512 to 1023 octets Packets Good Bad */

/***  Bit definition for ETH_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD register  ****/
#define ETH_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_TX1024_MAXOCTGB_Pos     (0U)
#define ETH_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_TX1024_MAXOCTGB_Msk     (0xFFFFFFFFUL << ETH_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_TX1024_MAXOCTGB_Pos)   /*!< 0xFFFFFFFF */
#define ETH_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_TX1024_MAXOCTGB         ETH_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD_TX1024_MAXOCTGB_Msk              /*!< Tx 1024 to Max octets Packets Good Bad */

/*******  Bit definition for ETH_TX_UNICAST_PACKETS_GOOD_BAD register  ********/
#define ETH_TX_UNICAST_PACKETS_GOOD_BAD_TXUCASTGB_Pos                   (0U)
#define ETH_TX_UNICAST_PACKETS_GOOD_BAD_TXUCASTGB_Msk                   (0xFFFFFFFFUL << ETH_TX_UNICAST_PACKETS_GOOD_BAD_TXUCASTGB_Pos)           /*!< 0xFFFFFFFF */
#define ETH_TX_UNICAST_PACKETS_GOOD_BAD_TXUCASTGB                       ETH_TX_UNICAST_PACKETS_GOOD_BAD_TXUCASTGB_Msk                            /*!< Tx Unicast Packets Good Bad */

/******  Bit definition for ETH_TX_MULTICAST_PACKETS_GOOD_BAD register  *******/
#define ETH_TX_MULTICAST_PACKETS_GOOD_BAD_TXMCASTGB_Pos                 (0U)
#define ETH_TX_MULTICAST_PACKETS_GOOD_BAD_TXMCASTGB_Msk                 (0xFFFFFFFFUL << ETH_TX_MULTICAST_PACKETS_GOOD_BAD_TXMCASTGB_Pos)         /*!< 0xFFFFFFFF */
#define ETH_TX_MULTICAST_PACKETS_GOOD_BAD_TXMCASTGB                     ETH_TX_MULTICAST_PACKETS_GOOD_BAD_TXMCASTGB_Msk                          /*!< Tx Multicast Packets Good Bad */

/******  Bit definition for ETH_TX_BROADCAST_PACKETS_GOOD_BAD register  *******/
#define ETH_TX_BROADCAST_PACKETS_GOOD_BAD_TXBCASTGB_Pos                 (0U)
#define ETH_TX_BROADCAST_PACKETS_GOOD_BAD_TXBCASTGB_Msk                 (0xFFFFFFFFUL << ETH_TX_BROADCAST_PACKETS_GOOD_BAD_TXBCASTGB_Pos)         /*!< 0xFFFFFFFF */
#define ETH_TX_BROADCAST_PACKETS_GOOD_BAD_TXBCASTGB                     ETH_TX_BROADCAST_PACKETS_GOOD_BAD_TXBCASTGB_Msk                          /*!< Tx Broadcast Packets Good Bad */

/********  Bit definition for ETH_TX_UNDERFLOW_ERROR_PACKETS register  ********/
#define ETH_TX_UNDERFLOW_ERROR_PACKETS_TXUNDRFLW_Pos                    (0U)
#define ETH_TX_UNDERFLOW_ERROR_PACKETS_TXUNDRFLW_Msk                    (0xFFFFFFFFUL << ETH_TX_UNDERFLOW_ERROR_PACKETS_TXUNDRFLW_Pos)            /*!< 0xFFFFFFFF */
#define ETH_TX_UNDERFLOW_ERROR_PACKETS_TXUNDRFLW                        ETH_TX_UNDERFLOW_ERROR_PACKETS_TXUNDRFLW_Msk                             /*!< Tx Underflow Error Packets */

/*****  Bit definition for ETH_TX_SINGLE_COLLISION_GOOD_PACKETS register  *****/
#define ETH_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG_Pos             (0U)
#define ETH_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG_Msk             (0xFFFFFFFFUL << ETH_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG_Pos)     /*!< 0xFFFFFFFF */
#define ETH_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG                 ETH_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG_Msk                      /*!< Tx Single Collision Good Packets */

/****  Bit definition for ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS register  ****/
#define ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG_Pos           (0U)
#define ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG_Msk           (0xFFFFFFFFUL << ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG_Pos)   /*!< 0xFFFFFFFF */
#define ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG               ETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG_Msk                    /*!< Tx Multiple Collision Good Packets */

/***********  Bit definition for ETH_TX_DEFERRED_PACKETS register  ************/
#define ETH_TX_DEFERRED_PACKETS_TXDEFRD_Pos                             (0U)
#define ETH_TX_DEFERRED_PACKETS_TXDEFRD_Msk                             (0xFFFFFFFFUL << ETH_TX_DEFERRED_PACKETS_TXDEFRD_Pos)                     /*!< 0xFFFFFFFF */
#define ETH_TX_DEFERRED_PACKETS_TXDEFRD                                 ETH_TX_DEFERRED_PACKETS_TXDEFRD_Msk                                      /*!< Tx Deferred Packets */

/********  Bit definition for ETH_TX_LATE_COLLISION_PACKETS register  *********/
#define ETH_TX_LATE_COLLISION_PACKETS_TXLATECOL_Pos                     (0U)
#define ETH_TX_LATE_COLLISION_PACKETS_TXLATECOL_Msk                     (0xFFFFFFFFUL << ETH_TX_LATE_COLLISION_PACKETS_TXLATECOL_Pos)             /*!< 0xFFFFFFFF */
#define ETH_TX_LATE_COLLISION_PACKETS_TXLATECOL                         ETH_TX_LATE_COLLISION_PACKETS_TXLATECOL_Msk                              /*!< Tx Late Collision Packets */

/******  Bit definition for ETH_TX_EXCESSIVE_COLLISION_PACKETS register  ******/
#define ETH_TX_EXCESSIVE_COLLISION_PACKETS_TXEXSCOL_Pos                 (0U)
#define ETH_TX_EXCESSIVE_COLLISION_PACKETS_TXEXSCOL_Msk                 (0xFFFFFFFFUL << ETH_TX_EXCESSIVE_COLLISION_PACKETS_TXEXSCOL_Pos)         /*!< 0xFFFFFFFF */
#define ETH_TX_EXCESSIVE_COLLISION_PACKETS_TXEXSCOL                     ETH_TX_EXCESSIVE_COLLISION_PACKETS_TXEXSCOL_Msk                          /*!< Tx Excessive Collision Packets */

/*********  Bit definition for ETH_TX_CARRIER_ERROR_PACKETS register  *********/
#define ETH_TX_CARRIER_ERROR_PACKETS_TXCARR_Pos                         (0U)
#define ETH_TX_CARRIER_ERROR_PACKETS_TXCARR_Msk                         (0xFFFFFFFFUL << ETH_TX_CARRIER_ERROR_PACKETS_TXCARR_Pos)                 /*!< 0xFFFFFFFF */
#define ETH_TX_CARRIER_ERROR_PACKETS_TXCARR                             ETH_TX_CARRIER_ERROR_PACKETS_TXCARR_Msk                                  /*!< Tx Carrier Error Packets */

/***********  Bit definition for ETH_TX_OCTET_COUNT_GOOD register  ************/
#define ETH_TX_OCTET_COUNT_GOOD_TXOCTG_Pos                              (0U)
#define ETH_TX_OCTET_COUNT_GOOD_TXOCTG_Msk                              (0xFFFFFFFFUL << ETH_TX_OCTET_COUNT_GOOD_TXOCTG_Pos)                      /*!< 0xFFFFFFFF */
#define ETH_TX_OCTET_COUNT_GOOD_TXOCTG                                  ETH_TX_OCTET_COUNT_GOOD_TXOCTG_Msk                                       /*!< Tx Octet Count Good */

