STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257dxx_ca35.h
/*****************  Bit definition for LVDS_PMMSCR register  ******************/
#define LVDS_PMMSCR_MST_SER_ERROR_INJ_Pos                      (0U)
#define LVDS_PMMSCR_MST_SER_ERROR_INJ_Msk                      (0x1FUL << LVDS_PMMSCR_MST_SER_ERROR_INJ_Pos)                     /*!< 0x0000001F */
#define LVDS_PMMSCR_MST_SER_ERROR_INJ                          LVDS_PMMSCR_MST_SER_ERROR_INJ_Msk                                /*!< Serializer error injection */
#define LVDS_PMMSCR_MST_SER_ERROR_INJ_0                        (0x1UL << LVDS_PMMSCR_MST_SER_ERROR_INJ_Pos)                      /*!< 0x00000001 */
#define LVDS_PMMSCR_MST_SER_ERROR_INJ_1                        (0x2UL << LVDS_PMMSCR_MST_SER_ERROR_INJ_Pos)                      /*!< 0x00000002 */
#define LVDS_PMMSCR_MST_SER_ERROR_INJ_2                        (0x4UL << LVDS_PMMSCR_MST_SER_ERROR_INJ_Pos)                      /*!< 0x00000004 */
#define LVDS_PMMSCR_MST_SER_ERROR_INJ_3                        (0x8UL << LVDS_PMMSCR_MST_SER_ERROR_INJ_Pos)                      /*!< 0x00000008 */
#define LVDS_PMMSCR_MST_SER_ERROR_INJ_4                        (0x10UL << LVDS_PMMSCR_MST_SER_ERROR_INJ_Pos)                     /*!< 0x00000010 */
#define LVDS_PMMSCR_MST_SER_FAULT_CLEAR_Pos                    (8U)
#define LVDS_PMMSCR_MST_SER_FAULT_CLEAR_Msk                    (0x1FUL << LVDS_PMMSCR_MST_SER_FAULT_CLEAR_Pos)                   /*!< 0x00001F00 */
#define LVDS_PMMSCR_MST_SER_FAULT_CLEAR                        LVDS_PMMSCR_MST_SER_FAULT_CLEAR_Msk                              /*!< Serializer fault clearing */
#define LVDS_PMMSCR_MST_SER_FAULT_CLEAR_0                      (0x1UL << LVDS_PMMSCR_MST_SER_FAULT_CLEAR_Pos)                  /*!< 0x00000100 */
#define LVDS_PMMSCR_MST_SER_FAULT_CLEAR_1                      (0x2UL << LVDS_PMMSCR_MST_SER_FAULT_CLEAR_Pos)                  /*!< 0x00000200 */
#define LVDS_PMMSCR_MST_SER_FAULT_CLEAR_2                      (0x4UL << LVDS_PMMSCR_MST_SER_FAULT_CLEAR_Pos)                  /*!< 0x00000400 */
#define LVDS_PMMSCR_MST_SER_FAULT_CLEAR_3                      (0x8UL << LVDS_PMMSCR_MST_SER_FAULT_CLEAR_Pos)                  /*!< 0x00000800 */
#define LVDS_PMMSCR_MST_SER_FAULT_CLEAR_4                      (0x10UL << LVDS_PMMSCR_MST_SER_FAULT_CLEAR_Pos)                 /*!< 0x00001000 */
#define LVDS_PMMSCR_MST_SER_LPBCK_Pos                          (16U)
#define LVDS_PMMSCR_MST_SER_LPBCK_Msk                          (0x1FUL << LVDS_PMMSCR_MST_SER_LPBCK_Pos)                         /*!< 0x001F0000 */
#define LVDS_PMMSCR_MST_SER_LPBCK                              LVDS_PMMSCR_MST_SER_LPBCK_Msk                                    /*!< Serializer fault loopback */
#define LVDS_PMMSCR_MST_SER_LPBCK_0                            (0x1UL << LVDS_PMMSCR_MST_SER_LPBCK_Pos)                      /*!< 0x00010000 */
#define LVDS_PMMSCR_MST_SER_LPBCK_1                            (0x2UL << LVDS_PMMSCR_MST_SER_LPBCK_Pos)                      /*!< 0x00020000 */
#define LVDS_PMMSCR_MST_SER_LPBCK_2                            (0x4UL << LVDS_PMMSCR_MST_SER_LPBCK_Pos)                      /*!< 0x00040000 */
#define LVDS_PMMSCR_MST_SER_LPBCK_3                            (0x8UL << LVDS_PMMSCR_MST_SER_LPBCK_Pos)                      /*!< 0x00080000 */
#define LVDS_PMMSCR_MST_SER_LPBCK_4                            (0x10UL << LVDS_PMMSCR_MST_SER_LPBCK_Pos)                     /*!< 0x00100000 */

/*****************  Bit definition for LVDS_PMMSSR register  ******************/
#define LVDS_PMMSSR_MST_SER_FAULT_Pos                          (0U)
#define LVDS_PMMSSR_MST_SER_FAULT_Msk                          (0x1FUL << LVDS_PMMSSR_MST_SER_FAULT_Pos)                         /*!< 0x0000001F */
#define LVDS_PMMSSR_MST_SER_FAULT                              LVDS_PMMSSR_MST_SER_FAULT_Msk                                    /*!< Serializer fault */
#define LVDS_PMMSSR_MST_SER_FAULT_0                            (0x1UL << LVDS_PMMSSR_MST_SER_FAULT_Pos)                          /*!< 0x00000001 */
#define LVDS_PMMSSR_MST_SER_FAULT_1                            (0x2UL << LVDS_PMMSSR_MST_SER_FAULT_Pos)                          /*!< 0x00000002 */
#define LVDS_PMMSSR_MST_SER_FAULT_2                            (0x4UL << LVDS_PMMSSR_MST_SER_FAULT_Pos)                          /*!< 0x00000004 */
#define LVDS_PMMSSR_MST_SER_FAULT_3                            (0x8UL << LVDS_PMMSSR_MST_SER_FAULT_Pos)                          /*!< 0x00000008 */
#define LVDS_PMMSSR_MST_SER_FAULT_4                            (0x10UL << LVDS_PMMSSR_MST_SER_FAULT_Pos)                         /*!< 0x00000010 */

/******************  Bit definition for LVDS_PMDCR register  ******************/
#define LVDS_PMDCR_MST_FORCE_ANALOG_OK_Pos                     (0U)
#define LVDS_PMDCR_MST_FORCE_ANALOG_OK_Msk                     (0x1UL << LVDS_PMDCR_MST_FORCE_ANALOG_OK_Pos)                     /*!< 0x00000001 */
#define LVDS_PMDCR_MST_FORCE_ANALOG_OK                         LVDS_PMDCR_MST_FORCE_ANALOG_OK_Msk                               /*!< When set to 1, this bit masks some functions in the LVDS-PHY. This bit can be used as a work around to functional problems with some of the monitor blocks */
#define LVDS_PMDCR_MST_PLL_FORCE_LDO_OK_Pos                    (4U)
#define LVDS_PMDCR_MST_PLL_FORCE_LDO_OK_Msk                    (0x1UL << LVDS_PMDCR_MST_PLL_FORCE_LDO_OK_Pos)                    /*!< 0x00000010 */
#define LVDS_PMDCR_MST_PLL_FORCE_LDO_OK                        LVDS_PMDCR_MST_PLL_FORCE_LDO_OK_Msk                              /*!< When set to 1, this bit masks some functions in the LVDS-PHY. This bit can be used as a work around to functional problems with some of the monitor blocks */
#define LVDS_PMDCR_MST_PLL_FORCE_LOCK_Pos                      (8U)
#define LVDS_PMDCR_MST_PLL_FORCE_LOCK_Msk                      (0x1UL << LVDS_PMDCR_MST_PLL_FORCE_LOCK_Pos)                      /*!< 0x00000100 */
#define LVDS_PMDCR_MST_PLL_FORCE_LOCK                          LVDS_PMDCR_MST_PLL_FORCE_LOCK_Msk                                /*!< When set to 1, this bit masks some functions in the LVDS-PHY. This bit can be used as a work around to functional problems with some of the monitor blocks */
#define LVDS_PMDCR_MST_POWER_OK_Pos                            (12U)
#define LVDS_PMDCR_MST_POWER_OK_Msk                            (0x1UL << LVDS_PMDCR_MST_POWER_OK_Pos)                            /*!< 0x00001000 */
#define LVDS_PMDCR_MST_POWER_OK                                LVDS_PMDCR_MST_POWER_OK_Msk                                      /*!< When set to 1, this bit masks some functions in the LVDS-PHY. This bit can be used as a work around to functional problems with some of the monitor blocks */

/*****************  Bit definition for LVDS_PMSSR1 register  ******************/
#define LVDS_PMSSR1_MST_DRV_A0_SPARE_RD_Pos                    (0U)
#define LVDS_PMSSR1_MST_DRV_A0_SPARE_RD_Msk                    (0xFFUL << LVDS_PMSSR1_MST_DRV_A0_SPARE_RD_Pos)                   /*!< 0x000000FF */
#define LVDS_PMSSR1_MST_DRV_A0_SPARE_RD                        LVDS_PMSSR1_MST_DRV_A0_SPARE_RD_Msk                              /*!< Spare outputs for data lane0 */
#define LVDS_PMSSR1_MST_DRV_A0_SPARE_RD_0                      (0x1UL << LVDS_PMSSR1_MST_DRV_A0_SPARE_RD_Pos)                    /*!< 0x00000001 */
#define LVDS_PMSSR1_MST_DRV_A0_SPARE_RD_1                      (0x2UL << LVDS_PMSSR1_MST_DRV_A0_SPARE_RD_Pos)                    /*!< 0x00000002 */
#define LVDS_PMSSR1_MST_DRV_A0_SPARE_RD_2                      (0x4UL << LVDS_PMSSR1_MST_DRV_A0_SPARE_RD_Pos)                    /*!< 0x00000004 */
#define LVDS_PMSSR1_MST_DRV_A0_SPARE_RD_3                      (0x8UL << LVDS_PMSSR1_MST_DRV_A0_SPARE_RD_Pos)                    /*!< 0x00000008 */
#define LVDS_PMSSR1_MST_DRV_A0_SPARE_RD_4                      (0x10UL << LVDS_PMSSR1_MST_DRV_A0_SPARE_RD_Pos)                   /*!< 0x00000010 */
#define LVDS_PMSSR1_MST_DRV_A0_SPARE_RD_5                      (0x20UL << LVDS_PMSSR1_MST_DRV_A0_SPARE_RD_Pos)                   /*!< 0x00000020 */
#define LVDS_PMSSR1_MST_DRV_A0_SPARE_RD_6                      (0x40UL << LVDS_PMSSR1_MST_DRV_A0_SPARE_RD_Pos)                   /*!< 0x00000040 */
#define LVDS_PMSSR1_MST_DRV_A0_SPARE_RD_7                      (0x80UL << LVDS_PMSSR1_MST_DRV_A0_SPARE_RD_Pos)                   /*!< 0x00000080 */
#define LVDS_PMSSR1_MST_DRV_A1_SPARE_RD_Pos                    (8U)
#define LVDS_PMSSR1_MST_DRV_A1_SPARE_RD_Msk                    (0xFFUL << LVDS_PMSSR1_MST_DRV_A1_SPARE_RD_Pos)                   /*!< 0x0000FF00 */
#define LVDS_PMSSR1_MST_DRV_A1_SPARE_RD                        LVDS_PMSSR1_MST_DRV_A1_SPARE_RD_Msk                              /*!< Spare outputs for data lane1 */
#define LVDS_PMSSR1_MST_DRV_A1_SPARE_RD_0                      (0x1UL << LVDS_PMSSR1_MST_DRV_A1_SPARE_RD_Pos)                  /*!< 0x00000100 */
#define LVDS_PMSSR1_MST_DRV_A1_SPARE_RD_1                      (0x2UL << LVDS_PMSSR1_MST_DRV_A1_SPARE_RD_Pos)                  /*!< 0x00000200 */
#define LVDS_PMSSR1_MST_DRV_A1_SPARE_RD_2                      (0x4UL << LVDS_PMSSR1_MST_DRV_A1_SPARE_RD_Pos)                  /*!< 0x00000400 */
#define LVDS_PMSSR1_MST_DRV_A1_SPARE_RD_3                      (0x8UL << LVDS_PMSSR1_MST_DRV_A1_SPARE_RD_Pos)                  /*!< 0x00000800 */
#define LVDS_PMSSR1_MST_DRV_A1_SPARE_RD_4                      (0x10UL << LVDS_PMSSR1_MST_DRV_A1_SPARE_RD_Pos)                 /*!< 0x00001000 */
#define LVDS_PMSSR1_MST_DRV_A1_SPARE_RD_5                      (0x20UL << LVDS_PMSSR1_MST_DRV_A1_SPARE_RD_Pos)                 /*!< 0x00002000 */
#define LVDS_PMSSR1_MST_DRV_A1_SPARE_RD_6                      (0x40UL << LVDS_PMSSR1_MST_DRV_A1_SPARE_RD_Pos)                 /*!< 0x00004000 */
#define LVDS_PMSSR1_MST_DRV_A1_SPARE_RD_7                      (0x80UL << LVDS_PMSSR1_MST_DRV_A1_SPARE_RD_Pos)                 /*!< 0x00008000 */
#define LVDS_PMSSR1_MST_DRV_A2_SPARE_RD_Pos                    (16U)
#define LVDS_PMSSR1_MST_DRV_A2_SPARE_RD_Msk                    (0xFFUL << LVDS_PMSSR1_MST_DRV_A2_SPARE_RD_Pos)                   /*!< 0x00FF0000 */
#define LVDS_PMSSR1_MST_DRV_A2_SPARE_RD                        LVDS_PMSSR1_MST_DRV_A2_SPARE_RD_Msk                              /*!< Spare outputs for data lane2 */
#define LVDS_PMSSR1_MST_DRV_A2_SPARE_RD_0                      (0x1UL << LVDS_PMSSR1_MST_DRV_A2_SPARE_RD_Pos)                /*!< 0x00010000 */
#define LVDS_PMSSR1_MST_DRV_A2_SPARE_RD_1                      (0x2UL << LVDS_PMSSR1_MST_DRV_A2_SPARE_RD_Pos)                /*!< 0x00020000 */
#define LVDS_PMSSR1_MST_DRV_A2_SPARE_RD_2                      (0x4UL << LVDS_PMSSR1_MST_DRV_A2_SPARE_RD_Pos)                /*!< 0x00040000 */
#define LVDS_PMSSR1_MST_DRV_A2_SPARE_RD_3                      (0x8UL << LVDS_PMSSR1_MST_DRV_A2_SPARE_RD_Pos)                /*!< 0x00080000 */
#define LVDS_PMSSR1_MST_DRV_A2_SPARE_RD_4                      (0x10UL << LVDS_PMSSR1_MST_DRV_A2_SPARE_RD_Pos)               /*!< 0x00100000 */
#define LVDS_PMSSR1_MST_DRV_A2_SPARE_RD_5                      (0x20UL << LVDS_PMSSR1_MST_DRV_A2_SPARE_RD_Pos)               /*!< 0x00200000 */
#define LVDS_PMSSR1_MST_DRV_A2_SPARE_RD_6                      (0x40UL << LVDS_PMSSR1_MST_DRV_A2_SPARE_RD_Pos)               /*!< 0x00400000 */
#define LVDS_PMSSR1_MST_DRV_A2_SPARE_RD_7                      (0x80UL << LVDS_PMSSR1_MST_DRV_A2_SPARE_RD_Pos)               /*!< 0x00800000 */
#define LVDS_PMSSR1_MST_DRV_A3_SPARE_RD_Pos                    (24U)
#define LVDS_PMSSR1_MST_DRV_A3_SPARE_RD_Msk                    (0xFFUL << LVDS_PMSSR1_MST_DRV_A3_SPARE_RD_Pos)                   /*!< 0xFF000000 */
#define LVDS_PMSSR1_MST_DRV_A3_SPARE_RD                        LVDS_PMSSR1_MST_DRV_A3_SPARE_RD_Msk                              /*!< Spare outputs for data lane3 */
#define LVDS_PMSSR1_MST_DRV_A3_SPARE_RD_0                      (0x1UL << LVDS_PMSSR1_MST_DRV_A3_SPARE_RD_Pos)              /*!< 0x01000000 */
#define LVDS_PMSSR1_MST_DRV_A3_SPARE_RD_1                      (0x2UL << LVDS_PMSSR1_MST_DRV_A3_SPARE_RD_Pos)              /*!< 0x02000000 */
#define LVDS_PMSSR1_MST_DRV_A3_SPARE_RD_2                      (0x4UL << LVDS_PMSSR1_MST_DRV_A3_SPARE_RD_Pos)              /*!< 0x04000000 */
#define LVDS_PMSSR1_MST_DRV_A3_SPARE_RD_3                      (0x8UL << LVDS_PMSSR1_MST_DRV_A3_SPARE_RD_Pos)              /*!< 0x08000000 */
#define LVDS_PMSSR1_MST_DRV_A3_SPARE_RD_4                      (0x10UL << LVDS_PMSSR1_MST_DRV_A3_SPARE_RD_Pos)             /*!< 0x10000000 */
#define LVDS_PMSSR1_MST_DRV_A3_SPARE_RD_5                      (0x20UL << LVDS_PMSSR1_MST_DRV_A3_SPARE_RD_Pos)             /*!< 0x20000000 */
#define LVDS_PMSSR1_MST_DRV_A3_SPARE_RD_6                      (0x40UL << LVDS_PMSSR1_MST_DRV_A3_SPARE_RD_Pos)             /*!< 0x40000000 */
#define LVDS_PMSSR1_MST_DRV_A3_SPARE_RD_7                      (0x80UL << LVDS_PMSSR1_MST_DRV_A3_SPARE_RD_Pos)             /*!< 0x80000000 */

/*****************  Bit definition for LVDS_PMSSR2 register  ******************/
#define LVDS_PMSSR2_MST_DRV_A4_SPARE_RD_Pos                    (0U)
#define LVDS_PMSSR2_MST_DRV_A4_SPARE_RD_Msk                    (0xFFUL << LVDS_PMSSR2_MST_DRV_A4_SPARE_RD_Pos)                   /*!< 0x000000FF */
#define LVDS_PMSSR2_MST_DRV_A4_SPARE_RD                        LVDS_PMSSR2_MST_DRV_A4_SPARE_RD_Msk                              /*!< Spare outputs for data lane4 */
#define LVDS_PMSSR2_MST_DRV_A4_SPARE_RD_0                      (0x1UL << LVDS_PMSSR2_MST_DRV_A4_SPARE_RD_Pos)                    /*!< 0x00000001 */
#define LVDS_PMSSR2_MST_DRV_A4_SPARE_RD_1                      (0x2UL << LVDS_PMSSR2_MST_DRV_A4_SPARE_RD_Pos)                    /*!< 0x00000002 */
#define LVDS_PMSSR2_MST_DRV_A4_SPARE_RD_2                      (0x4UL << LVDS_PMSSR2_MST_DRV_A4_SPARE_RD_Pos)                    /*!< 0x00000004 */
#define LVDS_PMSSR2_MST_DRV_A4_SPARE_RD_3                      (0x8UL << LVDS_PMSSR2_MST_DRV_A4_SPARE_RD_Pos)                    /*!< 0x00000008 */
#define LVDS_PMSSR2_MST_DRV_A4_SPARE_RD_4                      (0x10UL << LVDS_PMSSR2_MST_DRV_A4_SPARE_RD_Pos)                   /*!< 0x00000010 */
#define LVDS_PMSSR2_MST_DRV_A4_SPARE_RD_5                      (0x20UL << LVDS_PMSSR2_MST_DRV_A4_SPARE_RD_Pos)                   /*!< 0x00000020 */
#define LVDS_PMSSR2_MST_DRV_A4_SPARE_RD_6                      (0x40UL << LVDS_PMSSR2_MST_DRV_A4_SPARE_RD_Pos)                   /*!< 0x00000040 */
#define LVDS_PMSSR2_MST_DRV_A4_SPARE_RD_7                      (0x80UL << LVDS_PMSSR2_MST_DRV_A4_SPARE_RD_Pos)                   /*!< 0x00000080 */

