STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257dxx_ca35.h
/*****************  Bit definition for LVDS_PSMSSR register  ******************/
#define LVDS_PSMSSR_SLV_SER_FAULT_Pos                          (0U)
#define LVDS_PSMSSR_SLV_SER_FAULT_Msk                          (0x1FUL << LVDS_PSMSSR_SLV_SER_FAULT_Pos)                         /*!< 0x0000001F */
#define LVDS_PSMSSR_SLV_SER_FAULT                              LVDS_PSMSSR_SLV_SER_FAULT_Msk                                    /*!< Serializer fault */
#define LVDS_PSMSSR_SLV_SER_FAULT_0                            (0x1UL << LVDS_PSMSSR_SLV_SER_FAULT_Pos)                          /*!< 0x00000001 */
#define LVDS_PSMSSR_SLV_SER_FAULT_1                            (0x2UL << LVDS_PSMSSR_SLV_SER_FAULT_Pos)                          /*!< 0x00000002 */
#define LVDS_PSMSSR_SLV_SER_FAULT_2                            (0x4UL << LVDS_PSMSSR_SLV_SER_FAULT_Pos)                          /*!< 0x00000004 */
#define LVDS_PSMSSR_SLV_SER_FAULT_3                            (0x8UL << LVDS_PSMSSR_SLV_SER_FAULT_Pos)                          /*!< 0x00000008 */
#define LVDS_PSMSSR_SLV_SER_FAULT_4                            (0x10UL << LVDS_PSMSSR_SLV_SER_FAULT_Pos)                         /*!< 0x00000010 */

/******************  Bit definition for LVDS_PSDCR register  ******************/
#define LVDS_PSDCR_SLV_FORCE_ANALOG_OK_Pos                     (0U)
#define LVDS_PSDCR_SLV_FORCE_ANALOG_OK_Msk                     (0x1UL << LVDS_PSDCR_SLV_FORCE_ANALOG_OK_Pos)                     /*!< 0x00000001 */
#define LVDS_PSDCR_SLV_FORCE_ANALOG_OK                         LVDS_PSDCR_SLV_FORCE_ANALOG_OK_Msk                               /*!< When set to 1, this bit masks some functions in the LVDS-PHY. This bit can be used as a work around to functional problems with some of the monitor blocks */
#define LVDS_PSDCR_SLV_PLL_FORCE_LDO_OK_Pos                    (4U)
#define LVDS_PSDCR_SLV_PLL_FORCE_LDO_OK_Msk                    (0x1UL << LVDS_PSDCR_SLV_PLL_FORCE_LDO_OK_Pos)                    /*!< 0x00000010 */
#define LVDS_PSDCR_SLV_PLL_FORCE_LDO_OK                        LVDS_PSDCR_SLV_PLL_FORCE_LDO_OK_Msk                              /*!< When set to 1, this bit masks some functions in the LVDS PHY . This bit can be used as a work around to functional problems with some  of the monitor blocks */
#define LVDS_PSDCR_SLV_PLL_FORCE_LOCK_Pos                      (8U)
#define LVDS_PSDCR_SLV_PLL_FORCE_LOCK_Msk                      (0x1UL << LVDS_PSDCR_SLV_PLL_FORCE_LOCK_Pos)                      /*!< 0x00000100 */
#define LVDS_PSDCR_SLV_PLL_FORCE_LOCK                          LVDS_PSDCR_SLV_PLL_FORCE_LOCK_Msk                                /*!< When set to 1, this bit masks some functions in the LVDS PHY . This bit can be used as a work around to functional problems with some  of the monitor blocks */
#define LVDS_PSDCR_SLV_POWER_OK_Pos                            (12U)
#define LVDS_PSDCR_SLV_POWER_OK_Msk                            (0x1UL << LVDS_PSDCR_SLV_POWER_OK_Pos)                            /*!< 0x00001000 */
#define LVDS_PSDCR_SLV_POWER_OK                                LVDS_PSDCR_SLV_POWER_OK_Msk                                      /*!< When set to 1, this bit masks some functions in the LVDS-PHY. This bit can be used as a work around to functional problems with some of the monitor blocks */

/*****************  Bit definition for LVDS_PSSSR1 register  ******************/
#define LVDS_PSSSR1_SLV_DRV_A0_SPARE_RD_Pos                    (0U)
#define LVDS_PSSSR1_SLV_DRV_A0_SPARE_RD_Msk                    (0xFFUL << LVDS_PSSSR1_SLV_DRV_A0_SPARE_RD_Pos)                   /*!< 0x000000FF */
#define LVDS_PSSSR1_SLV_DRV_A0_SPARE_RD                        LVDS_PSSSR1_SLV_DRV_A0_SPARE_RD_Msk                              /*!< Spare outputs for data lane0 */
#define LVDS_PSSSR1_SLV_DRV_A0_SPARE_RD_0                      (0x1UL << LVDS_PSSSR1_SLV_DRV_A0_SPARE_RD_Pos)                    /*!< 0x00000001 */
#define LVDS_PSSSR1_SLV_DRV_A0_SPARE_RD_1                      (0x2UL << LVDS_PSSSR1_SLV_DRV_A0_SPARE_RD_Pos)                    /*!< 0x00000002 */
#define LVDS_PSSSR1_SLV_DRV_A0_SPARE_RD_2                      (0x4UL << LVDS_PSSSR1_SLV_DRV_A0_SPARE_RD_Pos)                    /*!< 0x00000004 */
#define LVDS_PSSSR1_SLV_DRV_A0_SPARE_RD_3                      (0x8UL << LVDS_PSSSR1_SLV_DRV_A0_SPARE_RD_Pos)                    /*!< 0x00000008 */
#define LVDS_PSSSR1_SLV_DRV_A0_SPARE_RD_4                      (0x10UL << LVDS_PSSSR1_SLV_DRV_A0_SPARE_RD_Pos)                   /*!< 0x00000010 */
#define LVDS_PSSSR1_SLV_DRV_A0_SPARE_RD_5                      (0x20UL << LVDS_PSSSR1_SLV_DRV_A0_SPARE_RD_Pos)                   /*!< 0x00000020 */
#define LVDS_PSSSR1_SLV_DRV_A0_SPARE_RD_6                      (0x40UL << LVDS_PSSSR1_SLV_DRV_A0_SPARE_RD_Pos)                   /*!< 0x00000040 */
#define LVDS_PSSSR1_SLV_DRV_A0_SPARE_RD_7                      (0x80UL << LVDS_PSSSR1_SLV_DRV_A0_SPARE_RD_Pos)                   /*!< 0x00000080 */
#define LVDS_PSSSR1_SLV_DRV_A1_SPARE_RD_Pos                    (8U)
#define LVDS_PSSSR1_SLV_DRV_A1_SPARE_RD_Msk                    (0xFFUL << LVDS_PSSSR1_SLV_DRV_A1_SPARE_RD_Pos)                   /*!< 0x0000FF00 */
#define LVDS_PSSSR1_SLV_DRV_A1_SPARE_RD                        LVDS_PSSSR1_SLV_DRV_A1_SPARE_RD_Msk                              /*!< Spare outputs for data lane1 */
#define LVDS_PSSSR1_SLV_DRV_A1_SPARE_RD_0                      (0x1UL << LVDS_PSSSR1_SLV_DRV_A1_SPARE_RD_Pos)                  /*!< 0x00000100 */
#define LVDS_PSSSR1_SLV_DRV_A1_SPARE_RD_1                      (0x2UL << LVDS_PSSSR1_SLV_DRV_A1_SPARE_RD_Pos)                  /*!< 0x00000200 */
#define LVDS_PSSSR1_SLV_DRV_A1_SPARE_RD_2                      (0x4UL << LVDS_PSSSR1_SLV_DRV_A1_SPARE_RD_Pos)                  /*!< 0x00000400 */
#define LVDS_PSSSR1_SLV_DRV_A1_SPARE_RD_3                      (0x8UL << LVDS_PSSSR1_SLV_DRV_A1_SPARE_RD_Pos)                  /*!< 0x00000800 */
#define LVDS_PSSSR1_SLV_DRV_A1_SPARE_RD_4                      (0x10UL << LVDS_PSSSR1_SLV_DRV_A1_SPARE_RD_Pos)                 /*!< 0x00001000 */
#define LVDS_PSSSR1_SLV_DRV_A1_SPARE_RD_5                      (0x20UL << LVDS_PSSSR1_SLV_DRV_A1_SPARE_RD_Pos)                 /*!< 0x00002000 */
#define LVDS_PSSSR1_SLV_DRV_A1_SPARE_RD_6                      (0x40UL << LVDS_PSSSR1_SLV_DRV_A1_SPARE_RD_Pos)                 /*!< 0x00004000 */
#define LVDS_PSSSR1_SLV_DRV_A1_SPARE_RD_7                      (0x80UL << LVDS_PSSSR1_SLV_DRV_A1_SPARE_RD_Pos)                 /*!< 0x00008000 */
#define LVDS_PSSSR1_SLV_DRV_A2_SPARE_RD_Pos                    (16U)
#define LVDS_PSSSR1_SLV_DRV_A2_SPARE_RD_Msk                    (0xFFUL << LVDS_PSSSR1_SLV_DRV_A2_SPARE_RD_Pos)                   /*!< 0x00FF0000 */
#define LVDS_PSSSR1_SLV_DRV_A2_SPARE_RD                        LVDS_PSSSR1_SLV_DRV_A2_SPARE_RD_Msk                              /*!< Spare outputs for data lane2 */
#define LVDS_PSSSR1_SLV_DRV_A2_SPARE_RD_0                      (0x1UL << LVDS_PSSSR1_SLV_DRV_A2_SPARE_RD_Pos)                /*!< 0x00010000 */
#define LVDS_PSSSR1_SLV_DRV_A2_SPARE_RD_1                      (0x2UL << LVDS_PSSSR1_SLV_DRV_A2_SPARE_RD_Pos)                /*!< 0x00020000 */
#define LVDS_PSSSR1_SLV_DRV_A2_SPARE_RD_2                      (0x4UL << LVDS_PSSSR1_SLV_DRV_A2_SPARE_RD_Pos)                /*!< 0x00040000 */
#define LVDS_PSSSR1_SLV_DRV_A2_SPARE_RD_3                      (0x8UL << LVDS_PSSSR1_SLV_DRV_A2_SPARE_RD_Pos)                /*!< 0x00080000 */
#define LVDS_PSSSR1_SLV_DRV_A2_SPARE_RD_4                      (0x10UL << LVDS_PSSSR1_SLV_DRV_A2_SPARE_RD_Pos)               /*!< 0x00100000 */
#define LVDS_PSSSR1_SLV_DRV_A2_SPARE_RD_5                      (0x20UL << LVDS_PSSSR1_SLV_DRV_A2_SPARE_RD_Pos)               /*!< 0x00200000 */
#define LVDS_PSSSR1_SLV_DRV_A2_SPARE_RD_6                      (0x40UL << LVDS_PSSSR1_SLV_DRV_A2_SPARE_RD_Pos)               /*!< 0x00400000 */
#define LVDS_PSSSR1_SLV_DRV_A2_SPARE_RD_7                      (0x80UL << LVDS_PSSSR1_SLV_DRV_A2_SPARE_RD_Pos)               /*!< 0x00800000 */
#define LVDS_PSSSR1_SLV_DRV_A3_SPARE_RD_Pos                    (24U)
#define LVDS_PSSSR1_SLV_DRV_A3_SPARE_RD_Msk                    (0xFFUL << LVDS_PSSSR1_SLV_DRV_A3_SPARE_RD_Pos)                   /*!< 0xFF000000 */
#define LVDS_PSSSR1_SLV_DRV_A3_SPARE_RD                        LVDS_PSSSR1_SLV_DRV_A3_SPARE_RD_Msk                              /*!< Spare outputs for data lane3 */
#define LVDS_PSSSR1_SLV_DRV_A3_SPARE_RD_0                      (0x1UL << LVDS_PSSSR1_SLV_DRV_A3_SPARE_RD_Pos)              /*!< 0x01000000 */
#define LVDS_PSSSR1_SLV_DRV_A3_SPARE_RD_1                      (0x2UL << LVDS_PSSSR1_SLV_DRV_A3_SPARE_RD_Pos)              /*!< 0x02000000 */
#define LVDS_PSSSR1_SLV_DRV_A3_SPARE_RD_2                      (0x4UL << LVDS_PSSSR1_SLV_DRV_A3_SPARE_RD_Pos)              /*!< 0x04000000 */
#define LVDS_PSSSR1_SLV_DRV_A3_SPARE_RD_3                      (0x8UL << LVDS_PSSSR1_SLV_DRV_A3_SPARE_RD_Pos)              /*!< 0x08000000 */
#define LVDS_PSSSR1_SLV_DRV_A3_SPARE_RD_4                      (0x10UL << LVDS_PSSSR1_SLV_DRV_A3_SPARE_RD_Pos)             /*!< 0x10000000 */
#define LVDS_PSSSR1_SLV_DRV_A3_SPARE_RD_5                      (0x20UL << LVDS_PSSSR1_SLV_DRV_A3_SPARE_RD_Pos)             /*!< 0x20000000 */
#define LVDS_PSSSR1_SLV_DRV_A3_SPARE_RD_6                      (0x40UL << LVDS_PSSSR1_SLV_DRV_A3_SPARE_RD_Pos)             /*!< 0x40000000 */
#define LVDS_PSSSR1_SLV_DRV_A3_SPARE_RD_7                      (0x80UL << LVDS_PSSSR1_SLV_DRV_A3_SPARE_RD_Pos)             /*!< 0x80000000 */

/*****************  Bit definition for LVDS_PSSSR2 register  ******************/
#define LVDS_PSSSR2_SLV_DRV_A4_SPARE_RD_Pos                    (0U)
#define LVDS_PSSSR2_SLV_DRV_A4_SPARE_RD_Msk                    (0xFFUL << LVDS_PSSSR2_SLV_DRV_A4_SPARE_RD_Pos)                   /*!< 0x000000FF */
#define LVDS_PSSSR2_SLV_DRV_A4_SPARE_RD                        LVDS_PSSSR2_SLV_DRV_A4_SPARE_RD_Msk                              /*!< Spare outputs for data lane4 */
#define LVDS_PSSSR2_SLV_DRV_A4_SPARE_RD_0                      (0x1UL << LVDS_PSSSR2_SLV_DRV_A4_SPARE_RD_Pos)                    /*!< 0x00000001 */
#define LVDS_PSSSR2_SLV_DRV_A4_SPARE_RD_1                      (0x2UL << LVDS_PSSSR2_SLV_DRV_A4_SPARE_RD_Pos)                    /*!< 0x00000002 */
#define LVDS_PSSSR2_SLV_DRV_A4_SPARE_RD_2                      (0x4UL << LVDS_PSSSR2_SLV_DRV_A4_SPARE_RD_Pos)                    /*!< 0x00000004 */
#define LVDS_PSSSR2_SLV_DRV_A4_SPARE_RD_3                      (0x8UL << LVDS_PSSSR2_SLV_DRV_A4_SPARE_RD_Pos)                    /*!< 0x00000008 */
#define LVDS_PSSSR2_SLV_DRV_A4_SPARE_RD_4                      (0x10UL << LVDS_PSSSR2_SLV_DRV_A4_SPARE_RD_Pos)                   /*!< 0x00000010 */
#define LVDS_PSSSR2_SLV_DRV_A4_SPARE_RD_5                      (0x20UL << LVDS_PSSSR2_SLV_DRV_A4_SPARE_RD_Pos)                   /*!< 0x00000020 */
#define LVDS_PSSSR2_SLV_DRV_A4_SPARE_RD_6                      (0x40UL << LVDS_PSSSR2_SLV_DRV_A4_SPARE_RD_Pos)                   /*!< 0x00000040 */
#define LVDS_PSSSR2_SLV_DRV_A4_SPARE_RD_7                      (0x80UL << LVDS_PSSSR2_SLV_DRV_A4_SPARE_RD_Pos)                   /*!< 0x00000080 */

/*****************  Bit definition for LVDS_PSCFGCR register  *****************/
#define LVDS_PSCFGCR_SLV_EN_DIG_DL_Pos                         (0U)
#define LVDS_PSCFGCR_SLV_EN_DIG_DL_Msk                         (0x1FUL << LVDS_PSCFGCR_SLV_EN_DIG_DL_Pos)                        /*!< 0x0000001F */
#define LVDS_PSCFGCR_SLV_EN_DIG_DL                             LVDS_PSCFGCR_SLV_EN_DIG_DL_Msk                                   /*!< Enables Digital DataLanes DL4..DL0 */
#define LVDS_PSCFGCR_SLV_EN_DIG_DL_0                           (0x1UL << LVDS_PSCFGCR_SLV_EN_DIG_DL_Pos)                         /*!< 0x00000001 */
#define LVDS_PSCFGCR_SLV_EN_DIG_DL_1                           (0x2UL << LVDS_PSCFGCR_SLV_EN_DIG_DL_Pos)                         /*!< 0x00000002 */
#define LVDS_PSCFGCR_SLV_EN_DIG_DL_2                           (0x4UL << LVDS_PSCFGCR_SLV_EN_DIG_DL_Pos)                         /*!< 0x00000004 */
#define LVDS_PSCFGCR_SLV_EN_DIG_DL_3                           (0x8UL << LVDS_PSCFGCR_SLV_EN_DIG_DL_Pos)                         /*!< 0x00000008 */
#define LVDS_PSCFGCR_SLV_EN_DIG_DL_4                           (0x10UL << LVDS_PSCFGCR_SLV_EN_DIG_DL_Pos)                        /*!< 0x00000010 */

/*****************  Bit definition for LVDS_WCLKCR register  ******************/
#define LVDS_WCLKCR_SLV_CLKPIX_SEL_Pos                         (0U)
#define LVDS_WCLKCR_SLV_CLKPIX_SEL_Msk                         (0x1UL << LVDS_WCLKCR_SLV_CLKPIX_SEL_Pos)                         /*!< 0x00000001 */
#define LVDS_WCLKCR_SLV_CLKPIX_SEL                             LVDS_WCLKCR_SLV_CLKPIX_SEL_Msk                                   /*!< Pixel clock selection: */
#define LVDS_WCLKCR_SRCSEL_Pos                                 (8U)
#define LVDS_WCLKCR_SRCSEL_Msk                                 (0x1UL << LVDS_WCLKCR_SRCSEL_Pos)                                 /*!< 0x00000100 */
#define LVDS_WCLKCR_SRCSEL                                     LVDS_WCLKCR_SRCSEL_Msk                                           /*!< Source Selection for the Pixel Clock, between master and slave PHY: */

