STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257dxx_ca35.h
/***************  Bit definition for SYSCFG_DLYBSD3SR register  ***************/
#define SYSCFG_DLYBSD3SR_LOCK_Pos                                          (0U)
#define SYSCFG_DLYBSD3SR_LOCK_Msk                                          (0x1UL << SYSCFG_DLYBSD3SR_LOCK_Pos)                                            /*!< 0x00000001 */
#define SYSCFG_DLYBSD3SR_LOCK                                              SYSCFG_DLYBSD3SR_LOCK_Msk                                                      /*!< When 1, DLL is locked */
#define SYSCFG_DLYBSD3SR_RX_TAP_SEL_ACK_Pos                                (1U)
#define SYSCFG_DLYBSD3SR_RX_TAP_SEL_ACK_Msk                                (0x1UL << SYSCFG_DLYBSD3SR_RX_TAP_SEL_ACK_Pos)                                  /*!< 0x00000002 */
#define SYSCFG_DLYBSD3SR_RX_TAP_SEL_ACK                                    SYSCFG_DLYBSD3SR_RX_TAP_SEL_ACK_Msk                                            /*!< When â1â, the RX delay has switched to the tap value specified in RX_TAP_SEL[5:0] */

/***************  Bit definition for SYSCFG_DLYBOS1CR register  ***************/
#define SYSCFG_DLYBOS1CR_EN_Pos                                            (0U)
#define SYSCFG_DLYBOS1CR_EN_Msk                                            (0x1UL << SYSCFG_DLYBOS1CR_EN_Pos)                                              /*!< 0x00000001 */
#define SYSCFG_DLYBOS1CR_EN                                                SYSCFG_DLYBOS1CR_EN_Msk                                                        /*!< When 1, DLL is enabled */
#define SYSCFG_DLYBOS1CR_RX_TAP_SEL_Pos                                    (1U)
#define SYSCFG_DLYBOS1CR_RX_TAP_SEL_Msk                                    (0x3FUL << SYSCFG_DLYBOS1CR_RX_TAP_SEL_Pos)                                     /*!< 0x0000007E */
#define SYSCFG_DLYBOS1CR_RX_TAP_SEL                                        SYSCFG_DLYBOS1CR_RX_TAP_SEL_Msk                                                /*!< selection of TAP delay for RX clock */
#define SYSCFG_DLYBOS1CR_TX_TAP_SEL_Pos                                    (7U)
#define SYSCFG_DLYBOS1CR_TX_TAP_SEL_Msk                                    (0x3FUL << SYSCFG_DLYBOS1CR_TX_TAP_SEL_Pos)                                     /*!< 0x00001F80 */
#define SYSCFG_DLYBOS1CR_TX_TAP_SEL                                        SYSCFG_DLYBOS1CR_TX_TAP_SEL_Msk                                                /*!< selection of TAP delay for TX clock */
#define SYSCFG_DLYBOS1CR_BYP_EN_Pos                                        (16U)
#define SYSCFG_DLYBOS1CR_BYP_EN_Msk                                        (0x1UL << SYSCFG_DLYBOS1CR_BYP_EN_Pos)                                          /*!< 0x00010000 */
#define SYSCFG_DLYBOS1CR_BYP_EN                                            SYSCFG_DLYBOS1CR_BYP_EN_Msk                                                    /*!< When 1, DLL bypass mode is enabled */
#define SYSCFG_DLYBOS1CR_BYP_CMD_Pos                                       (17U)
#define SYSCFG_DLYBOS1CR_BYP_CMD_Msk                                       (0x1FUL << SYSCFG_DLYBOS1CR_BYP_CMD_Pos)                                        /*!< 0x003E0000 */
#define SYSCFG_DLYBOS1CR_BYP_CMD                                           SYSCFG_DLYBOS1CR_BYP_CMD_Msk                                                   /*!< value of the delay unit when in DLL bypass mode */

/***************  Bit definition for SYSCFG_DLYBOS1SR register  ***************/
#define SYSCFG_DLYBOS1SR_LOCK_Pos                                          (0U)
#define SYSCFG_DLYBOS1SR_LOCK_Msk                                          (0x1UL << SYSCFG_DLYBOS1SR_LOCK_Pos)                                            /*!< 0x00000001 */
#define SYSCFG_DLYBOS1SR_LOCK                                              SYSCFG_DLYBOS1SR_LOCK_Msk                                                      /*!< When 1, DLL is locked */
#define SYSCFG_DLYBOS1SR_RX_TAP_SEL_ACK_Pos                                (1U)
#define SYSCFG_DLYBOS1SR_RX_TAP_SEL_ACK_Msk                                (0x1UL << SYSCFG_DLYBOS1SR_RX_TAP_SEL_ACK_Pos)                                  /*!< 0x00000002 */
#define SYSCFG_DLYBOS1SR_RX_TAP_SEL_ACK                                    SYSCFG_DLYBOS1SR_RX_TAP_SEL_ACK_Msk                                            /*!< When â1â, the RX delay has switched to the tap value specified in RX_TAP_SEL[5:0] */
#define SYSCFG_DLYBOS1SR_TX_TAP_SEL_ACK_Pos                                (2U)
#define SYSCFG_DLYBOS1SR_TX_TAP_SEL_ACK_Msk                                (0x1UL << SYSCFG_DLYBOS1SR_TX_TAP_SEL_ACK_Pos)                                  /*!< 0x00000004 */
#define SYSCFG_DLYBOS1SR_TX_TAP_SEL_ACK                                    SYSCFG_DLYBOS1SR_TX_TAP_SEL_ACK_Msk                                            /*!< When â1â, the TX delay has switched to the tap value specified in TX_TAP_SEL[5:0] */

/***************  Bit definition for SYSCFG_DLYBOS2CR register  ***************/
#define SYSCFG_DLYBOS2CR_EN_Pos                                            (0U)
#define SYSCFG_DLYBOS2CR_EN_Msk                                            (0x1UL << SYSCFG_DLYBOS2CR_EN_Pos)                                              /*!< 0x00000001 */
#define SYSCFG_DLYBOS2CR_EN                                                SYSCFG_DLYBOS2CR_EN_Msk                                                        /*!< When 1, DLL is enabled */
#define SYSCFG_DLYBOS2CR_RX_TAP_SEL_Pos                                    (1U)
#define SYSCFG_DLYBOS2CR_RX_TAP_SEL_Msk                                    (0x3FUL << SYSCFG_DLYBOS2CR_RX_TAP_SEL_Pos)                                     /*!< 0x0000007E */
#define SYSCFG_DLYBOS2CR_RX_TAP_SEL                                        SYSCFG_DLYBOS2CR_RX_TAP_SEL_Msk                                                /*!< selection of TAP delay for RX clock */
#define SYSCFG_DLYBOS2CR_TX_TAP_SEL_Pos                                    (7U)
#define SYSCFG_DLYBOS2CR_TX_TAP_SEL_Msk                                    (0x3FUL << SYSCFG_DLYBOS2CR_TX_TAP_SEL_Pos)                                     /*!< 0x00001F80 */
#define SYSCFG_DLYBOS2CR_TX_TAP_SEL                                        SYSCFG_DLYBOS2CR_TX_TAP_SEL_Msk                                                /*!< selection of TAP delay for TX clock */
#define SYSCFG_DLYBOS2CR_BYP_EN_Pos                                        (16U)
#define SYSCFG_DLYBOS2CR_BYP_EN_Msk                                        (0x1UL << SYSCFG_DLYBOS2CR_BYP_EN_Pos)                                          /*!< 0x00010000 */
#define SYSCFG_DLYBOS2CR_BYP_EN                                            SYSCFG_DLYBOS2CR_BYP_EN_Msk                                                    /*!< DLL bypass mode is enabled */
#define SYSCFG_DLYBOS2CR_BYP_CMD_Pos                                       (17U)
#define SYSCFG_DLYBOS2CR_BYP_CMD_Msk                                       (0x1FUL << SYSCFG_DLYBOS2CR_BYP_CMD_Pos)                                        /*!< 0x003E0000 */
#define SYSCFG_DLYBOS2CR_BYP_CMD                                           SYSCFG_DLYBOS2CR_BYP_CMD_Msk                                                   /*!< value of the delay unit when in DLL bypass mode */

